INSERT INTO PERSON(birth_dt, inn_no, email_txt, phone_no) VALUES
('1995-12-12', '423789429780', 'halyapov@yandex.ru', '79726071601'),
('1995-10-23', '254056056075',	'gusev@gmail.com',	'79472291902'),
('1994-05-30',	'920413462665',	'sadikov@yandex.ru',	'79920538007'),
('1994-09-30',	'254057772225',	'poberezniy@gmail.com',	'79474081607'),
('1996-07-28',	'463203328426',	'vasilev@mail.ru',	'79214600113'),
('2000-07-30',	'309057711160',	'sadikov.t@gmail.com',	'79270254587'),
('2000-05-22',	'348243417603',	'kroo@gmail.com',	'79711840079'),
('2000-08-14',	'706341159615',	'kuznetsov@yandex.ru', '79302239581'),
('1999-09-09',	'663689047233',	'poyarkov@mail.ru', '79618636881'),
('2001-06-23',	'627492189891',	'pugachev@yandex.ru', '79196100330'),
('1985-08-30',	'612979123097',	'payer1@mail.ru', '79618630881'),
('1985-07-03',	'348243547603',	'payer2@mail.ru', '79214600999'),
('1983-08-30',	'423789429999',	'payer3@yandex.ru', '79210000222'),
('1983-03-30',	'706341412343',	'payer4@gmail.com', '79473330302');

INSERT INTO PERSON_HOME_ADDRESS(person_id, address_txt, valid_from_dttm) VALUES
(1,	'г. Москва, ул. Шестакова, д. 7, кв. 2',	'2016-08-02'),
(2,	'г. Москва, ул. Шестакова, д. 11, кв. 14',	'2016-09-04'),
(3,	'г. Москва, ул. Шестакова, д. 12, кв. 20',	'2019-01-22'),
(4,	'г. Москва, ул. Гагарина, д. 17, кв. 36',	'2017-07-03'),
(5,	'г. Москва, Дмитровское шоссе, д. 100, кв. 2',	'2019-01-20'),
(6,	'г. Долгопрудный, ул. Первомайская, д. 32 к, 2',	'2019-01-24'),
(7,	'г. Долгопрудный, ул. Первомайская, д. 32 к, 2',	'2019-01-26'),
(8,	'г. Долгопрудный, ул. Первомайская, д. 32 к, 2',	'2019-01-27'),
(9,	'г. Долгопрудный, Институтский переулок, д. 108',	'2018-01-27'),
(10,	'г. Долгопрудный, Институтский переулок, д. 78',	'2018-01-22'),
(8,	'г. Долгопрудный, Институтский переулок, д. 42',	'2018-04-22'),
(11, 'г. Долгопрудный, ул. Менделеева, д. 108',	'2017-09-05'),
(12, 'г. Долгопрудный, ул. Менделеева, д. 77',	'2009-04-08'),
(13,	'г. Долгопрудный, ул. Менделеева, д. 98', '2013-11-26'),
(14,	'г. Долгопрудный, ул. Менделеева, д. 206',	'2014-04-28');

INSERT INTO PERSON_DOCUMENT(document_no, document_series, document_type_txt, person_id, person_name_nm, authority_no, valid_from_dttm) VALUES
(754324, '8006',	'Паспорт РФ',	1,	'Халяпов Александр',	'423-532',	'2018-07-21'),
(534153, '8006',	'Паспорт РФ',	2,	'Гусев Илья',	'423-543',	'2018-06-08'),
(625424, '8007',	'Паспорт РФ',	3,	'Садыков Ринат',	'546-654',	'2017-07-05'),
(789412, '8007',	'Паспорт РФ',	4,	'Побережный Антон Даниилович',	'123-098',	'2017-08-22'),
(849322, '8015',	'Паспорт РФ',	5,	'Васильев Николай Константинович',	'498-688',	'2014-07-08'),
(482918, '8015',	'Паспорт РФ',	6,	'Садыков Тимур Ильшатович',	'123-876',	'2014-08-08'),
(958132, '8015',	'Загранпаспорт РФ',	7,	'Кроо Дмитрий Станиславович',	'123-543',	'2015-09-09'),
(432787, '8015',	'Паспорт РФ',	8,	'Кузнецов Евгений Михайлович',	'123-708',	'2015-04-07'),
(809861, '8015',	'Паспорт РФ',	9,	'Поярков Андрей Святославович',	'619-904',	'2015-11-25'),
(478293, '8014',	'Загранпаспорт РФ',	10,	'Пугачев Илья Викторович',	'574-654',	'2013-07-12'),
(808912, '8014',	'Паспорт РФ',	7,	'Кроо Дмитрий Станиславович',	'836-817',	'2019-03-04'),
(423893, '5324',	'Паспорт РФ',	11,	'Иванов Иван Иванович',	'432-123', '1995-01-01'),
(910349, '5342',	'Паспорт РФ',	12,	'Денисов Денис Денисович',	'789-543',	'1996-02-02'),
(489427, '6542',	'Паспорт РФ',	13,	'Александров Александр Александрович',	'123-542',	'1997-03-03'),
(971053, '1234',	'Паспорт РФ',	14,	'Сергеев Сергей Сергеевич',	'752-067',	'1998-04-04');

INSERT INTO TEACHER_PERSON(person_id, working_start_dt, salary_amt, employment_record_no) VALUES
(1, '2018-07-21',	75000,	63425342),
(2, '2018-06-08',	75000,	62345243),
(3, '2017-07-05',	73000,	62345342),
(4, '2017-08-22',	72000,	68543212);

INSERT INTO COURSE(sphere_txt, name_txt, course_start_dt, course_end_dt, month_price_amt, teacher_person_id) VALUES
('Компьютерные науки', 'Базы данных',	'2019-02-06', '2019-05-22',	3000,	1),
('Компьютерные науки', 'Python',	'2019-02-04', '2019-05-20',	3000,	2),
('Компьютерные науки', 'Алгоритмы',	'2019-02-07', '2019-02-25',	3500,	2),
('Математическое', 'Основы комбинаторики',	'2019-02-05', '2019-05-21',	2500,	3),
('Программное ', 'моделирование физических процессов',	'2019-02-08', '2019-05-24',	2500,	4);

INSERT INTO COURSE_CLASS(week_day_txt, start_tm, end_tm, course_id) VALUES
('MO', '10:00:00', '12:00:00', 2),
('TU', '17:00:00', '20:00:00',	4),
('WE', '12:00:00', '15:00:00',	1),
('TH', '14:00:00', '15:30:00',	3),
('FR', '11:30:00', '13:00:00',	5),
('SA', '14:00:00', '15:30:00',	3);

INSERT INTO STUDENT_PERSON(PERSON_ID, VISITS_START_DT) VALUES
(5, '2019-02-03'),
(6, '2019-02-01'),
(7, '2019-02-02'),
(8, '2019-02-04'),
(9, '2019-02-05'),
(10, '2019-02-06');

INSERT INTO PERSON_X_PERSON(person_id, x_person_id, connection_type_txt) VALUES
(5, 11, 'Отец'),
(6,	11, 'Отец'),
(7,	12, 'Отец'),
(9,	13, 'Отец'),
(10,	14, 'Брат');

INSERT INTO CONTRACT(contract_dttm, student_person_id, payer_person_id, course_id, termination_dttm) VALUES
('2019-01-10', 5,	11,	1, NULL),
('2019-01-11',	5,	11,	2, NULL),
('2019-01-12',	5,	11,	3, NULL),
('2019-01-13',	6,	11,	1, NULL),
('2019-01-14',	6,	11,	2, NULL),
('2019-01-15',	6,	11,	5, NULL),
('2019-01-16',	7,	12,	3, NULL),
('2019-01-17',	7,	12,	4, NULL),
('2019-01-18',	8,	NULL,	3, NULL),
('2019-01-19',	8,	NULL,	5, NULL),
('2019-01-20',	9,	13,	1, NULL),
('2019-01-20',	9,	13,	4, NULL),
('2019-01-20',	10,	14,	2, NULL),
('2019-01-21',	10,	14,	5,	'2019-03-02');

INSERT INTO CONTRACT_PAYMENT(classes_month_no, classes_year_no, payment_dttm, payment_amt, contract_id, card_no, card_pay_flg) VALUES
(2,	2019, '2019-02-01',	3000,	1,	'1574241908902584',	TRUE),
(2,	2019, '2019-02-02',	3000,	2,	'4998529884694402',	TRUE),
(2,	2019, '2019-02-03',	3000,	3,	'8387424418599799',	TRUE),
(2,	2019, '2019-02-04',	3000,	4,	'6910519063986932',	TRUE),
(2,	2019, '2019-02-05',	2500,	5,	'9837979564688064',	TRUE),
(2,	2019, '2019-02-06',	2000,	6,	'2098062215527815',	TRUE),
(2,	2019, '2019-02-07',	2500,	7,	'4255184986408707',	TRUE),
(2,	2019, '2019-02-08',	2500,	8,	'7758792502611283',	TRUE),
(2,	2019, '2019-02-09',	3000,	9,	'4710426830779944',	TRUE),
(2,	2019, '2019-02-09',	3000,	10,	'1575728287883053',	TRUE),
(2,	2019, '2019-02-10',	2500,	11,	NULL,	FALSE),
(2,	2019, '2019-02-10',	3000,	12,	'6193044230596038',	TRUE),
(2,	2019, '2019-02-10',	3000,	13,	'4710426830779944',	TRUE),
(2,	2019, '2019-02-11',	3000,	14,	'9335169948191200',	TRUE),
(3,	2019, '2019-02-12',	2000,	1, NULL, FALSE),
(3,	2019, '2019-02-13',	3000,	2,	'4710426830779944',	TRUE),
(3,	2019, '2019-02-14',	3000,	3,	'2377611170338530',	TRUE),
(3,	2019, '2019-02-15',	3000,	4,	'9908709568239166',	TRUE),
(3,	2019, '2019-02-16',	3000,	5,	'6910519063986932',	TRUE);

INSERT INTO COMPLETION_CERTIFICATE(course_id, student_person_id, classes_start_dt, classes_end_dt) VALUES
(4, 5, '2018-02-04', '2019-05-30');